<template>
    <div class="content-wrapper">
        <Tabs 
            :titles="[
                'Описание', 
                // 'Область применения'
            ]"
        >
            <template #slot-0>
                <h3>{{ info?.description?.title || 'Описание' }}</h3>
                <ParsedHTML :html="info?.description?.text"/>
                <!-- <p>
                    Биметаллические ленточные пилы М42 от производителя имеют мартенситную структуру зубьев с высоким содержанием кобальта, 
                    что способствует хорошей закалке стали и гарантирует прочность. Биметалл – это комбинация двух типов металла, 
                    которые дополняют свойства друг друга – упругой и твердой стали на кромке и пружинного сплава на спинке полотна. 
                    Спинка изделия изготавливается из стали с высоким процентом хрома, что позволяет изделию выдерживать повышенные 
                    нагрузки и напряжения и не дает преждевременно изнашиваться при колебаниях и больших скоростях в работе. 
                    Данные пилы применяются в ленточнопильных станках универсального направления.
                </p> -->
            </template>
            <!-- <template #slot-1>
                <h3>Область применения</h3>
                <p>
                    Обработки стали разных видов (углеродистой, инструментальной, легированной, штамповочной), 
                    чугуна и цветных металлов; тонкостенные и толстостенные трубы; алюминиевые сплавы, 
                    медь и медные сплавы, латунь и бронза. При правильной настройке параметров работы станка 
                    и правильного подбора типа зубьев, увеличивается срок эксплуатации ленточной пилы. 
                    Для правильного подбора шага зубьев всегда можно обратиться к нашим сотрудникам.
                </p>
            </template> -->
        </Tabs>
    </div>
</template>

<script setup>
    const props = defineProps({
        info: Object
    });
</script>

<style lang="scss" scoped>
    h3{
        margin-bottom: 2.4rem;
    }

    :deep(.tabs-content){
        max-width: calc(80rem + 3.2rem * 2);
        margin: 0 auto;
    }
    
    @include desktop{
        p{
            @include font-p2;
        }

        :deep(.tabs-control){
            margin: 0 auto;
        }
    }

    @include mobile{
        h3{
            @include font-h2--mob;
        }
    }
</style>