import img0 from './image.png'
import img1 from './image_1.png'
import img2 from './image_2.png'

export default [
    {
        title: "Участие в международной выставке технологий в Германии",
        topic: "События и выставки",
        description: "REALREZ приняла участие в крупнейшей международной выставке технологий в Германии, где мы представили наши новейшие разработки в области лазерной обработки.",
        images: [{url: img0}]
    },
    {
        title: "Запуск нового лазерного станка L–400",
        topic: "Новые продукты и разработки",
        description: "Презентация нового станка с повышенной мощностью и точностью для самых сложных задач. Наши станки прошли независимое тестирование, которое подтвердило их высочайшую производительность и надёжность.",
        images: [{url: img1}]
    },
    {
        title: "Результаты независимого тестирования наших станков",
        topic: "рецензии и тестирования",
        description: "Наши станки прошли независимое тестирование, которое подтвердило их высочайшую производительность и надёжность.",
        images: [{url: img2}]
    }
]