
import mat0 from './mat0.webp';
import mat1 from './mat1.webp';
import mat2 from './mat2.webp';

export default [
    {
        "title": "Углеродистая сталь",
        "image": mat0,
        "options": [
            {
                "title": "Максимальная толщина резки/сварки",
                "values": [
                    "от 16 мм — до 22 мм (резка)",
                    "от 4 мм — до 9 мм (сварка)"
                ]
            },
            {
                "title": "Точность обработки",
                "values": ["±0,03 мм"]
            },
            {
                "title": "Рекомендуемые модели станков",
                "values": [
                    "REALREZ MY LCT 1500, 2000, 3000;",
                    "REALREZ OFL 1500, 2000, 3000"
                ]
            }
        ]
    },
    {
        "title": "Нержавеющая сталь",
        "image": mat1,
        "options": [
            {
                "title": "Максимальная толщина резки/сварки",
                "values": [
                    "от 6 мм - до 10 мм (резка)",
                    "от 4 мм - до 8 мм (сварка)"
                ]
            },
            {
                "title": "Точность обработки",
                "values": ["±0,03 мм"]
            },
            {
                "title": "Рекомендуемые модели станков",
                "values": [
                    "REALREZ MY LCT 1500, 2000, 3000;",
                    "REALREZ OFL 1500, 2000, 3000"
                ]
            }
        ]
    },
    {
        "title": "Алюминий",
        "image": mat2,
        "options": [
            {
                "title": "Максимальная толщина резки/сварки",
                "values": ["от 3 мм - до 6 мм"]
            },
            {
                "title": "Точность обработки",
                "values": ["±0,03 мм"]
            },
            {
                "title": "Рекомендуемые модели станков",
                "values": ["REALREZ MY LCT 1500, 2000, 3000"]
            }
        ]
    }
]