<template>
    <BasicPage 
        class="useful-page"
        title="Все, что вам нужно знать для обеспечения долговечности и эффективности вашего лазерного оборудования"
        :breadcrumbs="{title: 'Полезное'}"
    >
        <div class="content-wrapper">
            <Tabs
                :titles="list.map(e => e.title)"
                transition-block
            >
                <template v-for="(i,k) in list" #[`slot-${k}`]>
                    <div class="useful-page__tab">
                        <div v-html="i.content"></div>
                    </div>
                </template>
            </Tabs>
        </div>

        <GenericBlocks :list="['consultation']"/>
    </BasicPage>
</template>

<script setup>
const list = [
    {
        title: 'Сервис и гарантия',
        content: `
            <h3>Гарантия на оборудование REALREZ</h3>
            <p>На все оборудование предоставляется гарантия сроком до 2 лет с момента покупки.</p>
            <p>Гарантия покрывает дефекты и неисправности, возникшие в ходе нормальной эксплуатации оборудования. В случае обнаружения дефекта, мы оперативно произведём ремонт или замену оборудования.</p>
        `
    },
    {
        title: 'Обучение и поддержка',
        content: `
            <h3>Обучение и поддержка для вашего оборудования</h3>
            <p>Наши специалисты обеспечивают полное обучение работе с оборудованием REALREZ. Курс обучения включает теоретические и практические занятия, которые помогут вашим сотрудникам быстро освоить лазерные станки и применять их с максимальной эффективностью.</p>
            <p>Кроме того, наша служба технической поддержки готова помочь вам в любое время — от консультаций по настройке до оперативного ремонта оборудования.</p>
            <ul>
                <li>Обучение: 240-минутные курсы для специалистов</li>
                <li>Поддержка: Консультации и помощь по телефону или в режиме онлайн</li>
                <li>Обслуживание: Профессиональное техническое сопровождение на всех этапах работы с оборудованием</li>
            </ul>
        `
    },
    {
        title: 'Оплата и лизинг',
        content: `
            <h3>Оплата и лизинг</h3>
            <p>Для удобства наших клиентов мы предлагаем гибкие условия оплаты и возможность приобретения оборудования в лизинг. Наши финансовые партнеры предоставляют выгодные условия, которые позволят вам быстро и без лишних затрат обновить своё производственное оборудование.</p>
            <p>Способы оплаты: Безналичный расчет, банковский перевод, наличный расчёт.</p>
            <p>Лизинг: Сотрудничаем со всеми Лизинговыми Компаниями на Российском рынке.</p>
            <p>Документы: Оформление всей необходимой документации для приобретения оборудования в лизинг и сопровождение на всех этапах.</p>
        `
    },
    {
        title: 'Доставка',
        content: `
            <h3>Доставка оборудования REALREZ</h3>
            <p>Мы организуем доставку оборудования в любую точку РФ, гарантируя быструю и безопасную транспортировку. Все станки надёжно упакованы для предотвращения повреждений при транспортировке.</p>
            <p>Регион доставки: Вся территория РФ</p>
            <p>Сроки: 3-7 рабочих дней в зависимости от региона</p>
            <p>Гарантия транспортировки: Страхование груза и контроль на всех этапах доставки Транспортной компанией.</p>
        `
    }

]

</script>

<style lang="scss" scoped>
    .useful-page{
        --title-mb: 6.4rem;

        :deep(.tabs-content){
            max-width: calc(80rem + var(--padding));
        }

        :deep(.useful-page__tab){
            h3{
                @include font-h4;
                margin-bottom: 2.4rem;
            }

            p,
            ul{
                @include font-p2;

                &:not(:last-child){
                    margin-bottom: 1.6rem;
                }
            }

            li{
                list-style: disc;
                margin-left: 1.6rem
            }

        }

        @include mobile{
            --title-mb: 3.2rem;
        }
    }
</style>